GopalSaraf/Practicals/PSDL/include/proc/pic18f8525.inc
#define LATF7                            BANKMASK(LATF), 7, a
#define LATG0                            BANKMASK(LATG), 0, a
#define LATG1                            BANKMASK(LATG), 1, a
#define LATG2                            BANKMASK(LATG), 2, a
#define LATG3                            BANKMASK(LATG), 3, a
#define LATG4                            BANKMASK(LATG), 4, a
#define LATH0                            BANKMASK(LATH), 0, a
#define LATH1                            BANKMASK(LATH), 1, a
#define LATH2                            BANKMASK(LATH), 2, a
#define LATH3                            BANKMASK(LATH), 3, a
#define LATH4                            BANKMASK(LATH), 4, a
#define LATH5                            BANKMASK(LATH), 5, a
#define LATH6                            BANKMASK(LATH), 6, a
#define LATH7                            BANKMASK(LATH), 7, a
#define LATJ0                            BANKMASK(LATJ), 0, a
#define LATJ1                            BANKMASK(LATJ), 1, a
#define LATJ2                            BANKMASK(LATJ), 2, a
#define LATJ3                            BANKMASK(LATJ), 3, a
#define LATJ4                            BANKMASK(LATJ), 4, a
#define LATJ5                            BANKMASK(LATJ), 5, a
#define LATJ6                            BANKMASK(LATJ), 6, a
#define LATJ7                            BANKMASK(LATJ), 7, a
#define LB                               BANKMASK(PORTJ), 6, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC3                              BANKMASK(LATC), 3, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LD0                              BANKMASK(LATD), 0, a
#define LD1                              BANKMASK(LATD), 1, a
#define LD2                              BANKMASK(LATD), 2, a
#define LD3                              BANKMASK(LATD), 3, a
#define LD4                              BANKMASK(LATD), 4, a
#define LD5                              BANKMASK(LATD), 5, a
#define LD6                              BANKMASK(LATD), 6, a
#define LD7                              BANKMASK(LATD), 7, a
#define LE0                              BANKMASK(LATE), 0, a
#define LE1                              BANKMASK(LATE), 1, a
#define LE2                              BANKMASK(LATE), 2, a
#define LE3                              BANKMASK(LATE), 3, a
#define LE4                              BANKMASK(LATE), 4, a
#define LE5                              BANKMASK(LATE), 5, a
#define LE6                              BANKMASK(LATE), 6, a
#define LE7                              BANKMASK(LATE), 7, a
#define LF0                              BANKMASK(LATF), 0, a
#define LF1                              BANKMASK(LATF), 1, a
#define LF2                              BANKMASK(LATF), 2, a
#define LF3                              BANKMASK(LATF), 3, a
#define LF4                              BANKMASK(LATF), 4, a
#define LF5                              BANKMASK(LATF), 5, a
#define LF6                              BANKMASK(LATF), 6, a
#define LF7                              BANKMASK(LATF), 7, a
#define LG0                              BANKMASK(LATG), 0, a
#define LG1                              BANKMASK(LATG), 1, a
#define LG2                              BANKMASK(LATG), 2, a
#define LG3                              BANKMASK(LATG), 3, a
#define LG4                              BANKMASK(LATG), 4, a
#define LH0                              BANKMASK(LATH), 0, a
#define LH1                              BANKMASK(LATH), 1, a
#define LH2                              BANKMASK(LATH), 2, a
#define LH3                              BANKMASK(LATH), 3, a
#define LH4                              BANKMASK(LATH), 4, a
#define LH5                              BANKMASK(LATH), 5, a
#define LH6                              BANKMASK(LATH), 6, a
#define LH7                              BANKMASK(LATH), 7, a
#define LJ0                              BANKMASK(LATJ), 0, a
#define LJ1                              BANKMASK(LATJ), 1, a
#define LJ2                              BANKMASK(LATJ), 2, a
#define LJ3                              BANKMASK(LATJ), 3, a
#define LJ4                              BANKMASK(LATJ), 4, a
#define LJ5                              BANKMASK(LATJ), 5, a
#define LJ6                              BANKMASK(LATJ), 6, a
#define LJ7                              BANKMASK(LATJ), 7, a
#define LOCK                             BANKMASK(OSCCON), 3, a
#define LVDEN                            BANKMASK(LVDCON), 4, a
#define LVDIE                            BANKMASK(PIE2), 2, a
#define LVDIF                            BANKMASK(PIR2), 2, a
#define LVDIN                            BANKMASK(PORTA), 5, a
#define LVDIP                            BANKMASK(IPR2), 2, a
#define LVDL0                            BANKMASK(LVDCON), 0, a
#define LVDL1                            BANKMASK(LVDCON), 1, a
#define LVDL2                            BANKMASK(LVDCON), 2, a
#define LVDL3                            BANKMASK(LVDCON), 3, a
#define LVV0                             BANKMASK(LVDCON), 0, a
#define LVV1                             BANKMASK(LVDCON), 1, a
#define LVV2                             BANKMASK(LVDCON), 2, a
#define LVV3                             BANKMASK(LVDCON), 3, a
#define MCLR                             BANKMASK(PORTG), 5, a
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_A                            BANKMASK(SSPSTAT), 5, a
#define NOT_ADDRESS                      BANKMASK(SSPSTAT), 5, a
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_DONE                         BANKMASK(ADCON0), 1, a
#define NOT_IPEN                         BANKMASK(RCON), 7, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, a
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_W                            BANKMASK(SSPSTAT), 2, a
#define NOT_WRITE                        BANKMASK(SSPSTAT), 2, a
#define OBF                              BANKMASK(PSPCON), 6, a
#define OE                               BANKMASK(PORTJ), 1, a
#define OERR                             BANKMASK(RCSTA1), 1, a
#define OERR1                            BANKMASK(RCSTA1), 1, a
#define OERR2                            BANKMASK(RCSTA2), 1, a
#define OSC2                             BANKMASK(PORTA), 6, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define P1A                              BANKMASK(PORTC), 2, a
#define P1B                              BANKMASK(PORTE), 6, a
#define P1C                              BANKMASK(PORTE), 5, a
#define P1D                              BANKMASK(PORTG), 4, a
#define P1DC0                            BANKMASK(ECCP1DEL), 0, a
#define P1DC1                            BANKMASK(ECCP1DEL), 1, a
#define P1DC2                            BANKMASK(ECCP1DEL), 2, a
#define P1DC3                            BANKMASK(ECCP1DEL), 3, a
#define P1DC4                            BANKMASK(ECCP1DEL), 4, a
#define P1DC5                            BANKMASK(ECCP1DEL), 5, a
#define P1DC6                            BANKMASK(ECCP1DEL), 6, a
#define P1DC7                            BANKMASK(ECCP1DEL), 7, a
#define P1M0                             BANKMASK(CCP1CON), 6, a
#define P1M1                             BANKMASK(CCP1CON), 7, a
#define P1RSEN                           BANKMASK(ECCP1DEL), 7, a
#define P2B                              BANKMASK(PORTE), 2, a
#define P2C                              BANKMASK(PORTE), 1, a
#define P2D                              BANKMASK(PORTE), 0, a
#define P2DC0                            BANKMASK(ECCP2DEL), 0, a
#define P2DC1                            BANKMASK(ECCP2DEL), 1, a
#define P2DC2                            BANKMASK(ECCP2DEL), 2, a
#define P2DC3                            BANKMASK(ECCP2DEL), 3, a
#define P2DC4                            BANKMASK(ECCP2DEL), 4, a
#define P2DC5                            BANKMASK(ECCP2DEL), 5, a
#define P2DC6                            BANKMASK(ECCP2DEL), 6, a
#define P2M0                             BANKMASK(CCP2CON), 6, a
#define P2M1                             BANKMASK(CCP2CON), 7, a
#define P2RSEN                           BANKMASK(ECCP2DEL), 7, a
#define P3A                              BANKMASK(PORTG), 0, a
#define P3B                              BANKMASK(PORTE), 4, a
#define P3C                              BANKMASK(PORTE), 3, a
#define P3D                              BANKMASK(PORTG), 3, a
#define P3DC0                            BANKMASK(ECCP3DEL), 0, a
#define P3DC1                            BANKMASK(ECCP3DEL), 1, a
#define P3DC2                            BANKMASK(ECCP3DEL), 2, a
#define P3DC3                            BANKMASK(ECCP3DEL), 3, a
#define P3DC4                            BANKMASK(ECCP3DEL), 4, a
#define P3DC5                            BANKMASK(ECCP3DEL), 5, a
#define P3DC6                            BANKMASK(ECCP3DEL), 6, a
#define P3M0                             BANKMASK(CCP3CON), 6, a
#define P3M1                             BANKMASK(CCP3CON), 7, a
#define P3RSEN                           BANKMASK(ECCP3DEL), 7, a
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PA2E                             BANKMASK(PORTE), 7, a
#define PB1                              BANKMASK(PORTH), 7, a
#define PB1E                             BANKMASK(PORTE), 6, a
#define PB2                              BANKMASK(PORTE), 2, a
#define PB3                              BANKMASK(PORTH), 5, a
#define PB3E                             BANKMASK(PORTE), 4, a
#define PC1                              BANKMASK(PORTH), 6, a
#define PC1E                             BANKMASK(PORTE), 5, a
#define PC2                              BANKMASK(PORTE), 1, a
#define PC3                              BANKMASK(PORTH), 4, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PCFG0                            BANKMASK(ADCON1), 0, a
#define PCFG1                            BANKMASK(ADCON1), 1, a
#define PCFG2                            BANKMASK(ADCON1), 2, a
#define PCFG3                            BANKMASK(ADCON1), 3, a
#define PD                               BANKMASK(RCON), 2, a
#define PD2                              BANKMASK(PORTE), 0, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PEN                              BANKMASK(SSPCON2), 2, a
#define PGC                              BANKMASK(PORTB), 6, a
#define PGD                              BANKMASK(PORTB), 7, a
#define PGM                              BANKMASK(PORTB), 5, a
#define PLLEN                            BANKMASK(OSCCON), 2, a
#define POR                              BANKMASK(RCON), 1, a
#define PSA                              BANKMASK(T0CON), 3, a
#define PSP0                             BANKMASK(PORTD), 0, a
#define PSP1                             BANKMASK(PORTD), 1, a
#define PSP2                             BANKMASK(PORTD), 2, a
#define PSP3                             BANKMASK(PORTD), 3, a
#define PSP4                             BANKMASK(PORTD), 4, a
#define PSP5                             BANKMASK(PORTD), 5, a
#define PSP6                             BANKMASK(PORTD), 6, a
#define PSP7                             BANKMASK(PORTD), 7, a
#define PSPIE                            BANKMASK(PIE1), 7, a
#define PSPIF                            BANKMASK(PIR1), 7, a
#define PSPIP                            BANKMASK(IPR1), 7, a
#define PSPMODE                          BANKMASK(PSPCON), 4, a
#define PSS1AC0                          BANKMASK(ECCP1AS), 2, a
#define PSS1AC1                          BANKMASK(ECCP1AS), 3, a
#define PSS1BD0                          BANKMASK(ECCP1AS), 0, a
#define PSS1BD1                          BANKMASK(ECCP1AS), 1, a
#define PSS2AC0                          BANKMASK(ECCP2AS), 2, a
#define PSS2AC1                          BANKMASK(ECCP2AS), 3, a
#define PSS2BD0                          BANKMASK(ECCP2AS), 0, a
#define PSS2BD1                          BANKMASK(ECCP2AS), 1, a
#define PSS3AC0                          BANKMASK(ECCP3AS), 2, a
#define PSS3AC1                          BANKMASK(ECCP3AS), 3, a
#define PSS3BD0                          BANKMASK(ECCP3AS), 0, a
#define PSS3BD1                          BANKMASK(ECCP3AS), 1, a
#define RA0                              BANKMASK(PORTA), 0, a
#define RA1                              BANKMASK(PORTA), 1, a
#define RA2                              BANKMASK(PORTA), 2, a
#define RA3                              BANKMASK(PORTA), 3, a
#define RA4                              BANKMASK(PORTA), 4, a
#define RA5                              BANKMASK(PORTA), 5, a
#define RA6                              BANKMASK(PORTA), 6, a
#define RB0                              BANKMASK(PORTB), 0, a
#define RB1                              BANKMASK(PORTB), 1, a
#define RB2                              BANKMASK(PORTB), 2, a
#define RB3                              BANKMASK(PORTB), 3, a
#define RB4                              BANKMASK(PORTB), 4, a
#define RB5                              BANKMASK(PORTB), 5, a
#define RB6                              BANKMASK(PORTB), 6, a
#define RB7                              BANKMASK(PORTB), 7, a
#define RBIE                             BANKMASK(INTCON), 3, a
#define RBIF                             BANKMASK(INTCON), 0, a
#define RBIP                             BANKMASK(INTCON2), 0, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC0                              BANKMASK(PORTC), 0, a
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1IE                            BANKMASK(PIE1), 5, a
#define RC1IF                            BANKMASK(PIR1), 5, a
#define RC1IP                            BANKMASK(IPR1), 5, a
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2IE                            BANKMASK(PIE3), 5, a
#define RC2IF                            BANKMASK(PIR3), 5, a
#define RC2IP                            BANKMASK(IPR3), 5, a
#define RC3                              BANKMASK(PORTC), 3, a
#define RC4                              BANKMASK(PORTC), 4, a
#define RC5                              BANKMASK(PORTC), 5, a
#define RC6                              BANKMASK(PORTC), 6, a
#define RC7                              BANKMASK(PORTC), 7, a
#define RC8_9                            BANKMASK(RCSTA1), 6, a
#define RC8_92                           BANKMASK(RCSTA2), 6, a
#define RC9                              BANKMASK(RCSTA1), 6, a
#define RC92                             BANKMASK(RCSTA2), 6, a
#define RCD8                             BANKMASK(RCSTA1), 0, a
#define RCD82                            BANKMASK(RCSTA2), 0, a
#define RCEN                             BANKMASK(SSPCON2), 3, a
#define RCIDL                            BANKMASK(BAUDCON1), 6, a
#define RCIDL1                           BANKMASK(BAUDCON1), 6, a
#define RCIDL2                           BANKMASK(BAUDCON2), 6, a
#define RCIE                             BANKMASK(PIE1), 5, a
#define RCIF                             BANKMASK(PIR1), 5, a
#define RCIP                             BANKMASK(IPR1), 5, a
#define RCMT1                            BANKMASK(BAUDCON1), 6, a
#define RCMT2                            BANKMASK(BAUDCON2), 6, a
#define RD                               BANKMASK(EECON1), 0, a
#define RD0                              BANKMASK(PORTD), 0, a
#define RD1                              BANKMASK(PORTD), 1, a
#define RD163                            BANKMASK(T3CON), 7, a
#define RD2                              BANKMASK(PORTD), 2, a
#define RD3                              BANKMASK(PORTD), 3, a
#define RD4                              BANKMASK(PORTD), 4, a
#define RD5                              BANKMASK(PORTD), 5, a
#define RD6                              BANKMASK(PORTD), 6, a
#define RD7                              BANKMASK(PORTD), 7, a
#define RDE                              BANKMASK(PORTE), 0, a
#define RE0                              BANKMASK(PORTE), 0, a
#define RE1                              BANKMASK(PORTE), 1, a
#define RE2                              BANKMASK(PORTE), 2, a
#define RE3                              BANKMASK(PORTE), 3, a
#define RE4                              BANKMASK(PORTE), 4, a
#define RE5                              BANKMASK(PORTE), 5, a
#define RE6                              BANKMASK(PORTE), 6, a
#define RE7                              BANKMASK(PORTE), 7, a
#define READ_WRITE                       BANKMASK(SSPSTAT), 2, a
#define RF0                              BANKMASK(PORTF), 0, a
#define RF1                              BANKMASK(PORTF), 1, a
#define RF2                              BANKMASK(PORTF), 2, a
#define RF3                              BANKMASK(PORTF), 3, a
#define RF4                              BANKMASK(PORTF), 4, a
#define RF5                              BANKMASK(PORTF), 5, a
#define RF6                              BANKMASK(PORTF), 6, a
#define RF7                              BANKMASK(PORTF), 7, a
#define RG0                              BANKMASK(PORTG), 0, a
#define RG1                              BANKMASK(PORTG), 1, a
#define RG2                              BANKMASK(PORTG), 2, a
#define RG3                              BANKMASK(PORTG), 3, a
#define RG4                              BANKMASK(PORTG), 4, a
#define RG5                              BANKMASK(PORTG), 5, a
#define RH0                              BANKMASK(PORTH), 0, a
#define RH1                              BANKMASK(PORTH), 1, a
#define RH2                              BANKMASK(PORTH), 2, a
#define RH3                              BANKMASK(PORTH), 3, a
#define RH4                              BANKMASK(PORTH), 4, a
#define RH5                              BANKMASK(PORTH), 5, a
#define RH6                              BANKMASK(PORTH), 6, a
#define RH7                              BANKMASK(PORTH), 7, a
#define RI                               BANKMASK(RCON), 4, a
#define RJ0                              BANKMASK(PORTJ), 0, a
#define RJ1                              BANKMASK(PORTJ), 1, a
#define RJ2                              BANKMASK(PORTJ), 2, a
#define RJ3                              BANKMASK(PORTJ), 3, a
#define RJ4                              BANKMASK(PORTJ), 4, a
#define RJ5                              BANKMASK(PORTJ), 5, a
#define RJ6                              BANKMASK(PORTJ), 6, a
#define RJ7                              BANKMASK(PORTJ), 7, a
#define RJPU                             BANKMASK(PORTG), 5, a
#define RSEN                             BANKMASK(SSPCON2), 1, a
#define RW                               BANKMASK(SSPSTAT), 2, a
#define RX1                              BANKMASK(PORTC), 7, a
#define RX2                              BANKMASK(PORTG), 2, a
#define RX9                              BANKMASK(RCSTA1), 6, a
#define RX91                             BANKMASK(RCSTA1), 6, a
#define RX92                             BANKMASK(RCSTA2), 6, a
#define RX9D                             BANKMASK(RCSTA1), 0, a
#define RX9D1                            BANKMASK(RCSTA1), 0, a
#define RX9D2                            BANKMASK(RCSTA2), 0, a
#define RXB0IE                           BANKMASK(PIE3), 0, a
#define RXB1IE                           BANKMASK(PIE3), 1, a
#define RXBNIE                           BANKMASK(PIE3), 1, a
#define RXBNIF                           BANKMASK(PIR3), 1, a
#define RXBNIP                           BANKMASK(IPR3), 1, a
#define R_NOT_W                          BANKMASK(SSPSTAT), 2, a
#define R_W                              BANKMASK(SSPSTAT), 2, a
#define R_nW                             BANKMASK(SSPSTAT), 2, a
#define SCK                              BANKMASK(PORTC), 3, a
#define SCKP                             BANKMASK(BAUDCON1), 4, a
#define SCKP1                            BANKMASK(BAUDCON1), 4, a
#define SCKP2                            BANKMASK(BAUDCON2), 4, a
#define SCL                              BANKMASK(PORTC), 3, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SDA                              BANKMASK(PORTC), 4, a
#define SDI                              BANKMASK(PORTC), 4, a
#define SDO                              BANKMASK(PORTC), 5, a
#define SEN                              BANKMASK(SSPCON2), 0, a
#define SENDB                            BANKMASK(TXSTA1), 3, a
#define SENDB1                           BANKMASK(TXSTA1), 3, a
#define SENDB2                           BANKMASK(TXSTA2), 3, a
#define SMP                              BANKMASK(SSPSTAT), 7, a
#define SOSCEN                           BANKMASK(T1CON), 3, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SPEN                             BANKMASK(RCSTA1), 7, a
#define SPEN1                            BANKMASK(RCSTA1), 7, a
#define SPEN2                            BANKMASK(RCSTA2), 7, a
#define SREN                             BANKMASK(RCSTA1), 5, a
#define SREN1                            BANKMASK(RCSTA1), 5, a
#define SREN2                            BANKMASK(RCSTA2), 5, a
#define SRENA                            BANKMASK(RCSTA1), 5, a
#define SS                               BANKMASK(PORTF), 7, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSPEN                            BANKMASK(SSPCON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM0                            BANKMASK(SSPCON1), 0, a
#define SSPM1                            BANKMASK(SSPCON1), 1, a
#define SSPM2                            BANKMASK(SSPCON1), 2, a
#define SSPM3                            BANKMASK(SSPCON1), 3, a
#define SSPOV                            BANKMASK(SSPCON1), 6, a
#define START                            BANKMASK(SSPSTAT), 3, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
